Repository: 84000/data-translation-memory
Catalog: toh145-v4.tmx
Source language: bo
Languages: en

source: །ཆོས་གཅིག་སྒོ་མོ་ནས་ནི་དུ་མ་ཡི།
en: Through the avenue to a single Dharma teaching,

source: །ཆོས་ཀྱི་སྒོ་རྣམས་ཡུད་ཀྱིས་ཁོང་དུ་ཆུད།
en: Instantly understand the avenues to numerous Dharmas.

source: །ཆོས་ཀྱི་དབྱེ་བ་སེམས་ཅན་འཛིན་བཙུད་དེ།
en: “ ‘By causing sentient beings to uphold the opening of the Dharma,

source: །དོན་ལ་ངེས་པའི་ཡེ་ཤེས་རྣམ་ཕྱེ་ཞིང་།
en: Gnosis that ascertains its meaning will open up.

source: །ཆོས་ཀྱི་ཚིག་དོན་བརྗོད་པ་བྱས་པས་ན།
en: And by expressing the words and meaning of the Dharma,

source: །དེས་ན་ཡེ་ཤེས་ལྡན་པའི་འོད་ཟེར་གྲུབ།
en: They achieve light rays endowed with gnosis.

source: །ཤེས་རབ་སྒྲོན་མའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays of the lamp of discriminating wisdom,

source: །སྟོང་པ་བདག་མེད་མ་སྐྱེས་མ་བྱུང་ཞིང་། །རང་བཞིན་མེད་པའི་ཆོས་ལ་རབ་ཏུ་འཇུག
en: Will immerse themselves in teachings on things being empty, without self, Unborn, unarisen, and without nature.

source: །བདག་པོ་མེད་ཆོས་སྟོང་པ་བྱེད་མེད་པ།
en: “ ‘And by teaching that phenomena lack an owner, are empty, lack an agent,

source: །སྒྱུ་མ་སྨིག་རྒྱུ་ཆུ་ཟླ་མཚུངས་འདྲ་ཞིང་།
en: And are like a magical illusion or a mirage, like the reflection of the moon in water,

source: །རྨི་ལམ་མཚུངས་ལ་གཟུགས་བརྙན་འདྲ་བ་དག
en: Like a dream, and like a reflection in a mirror,

source: །བསྟན་པས་ཤེས་རབ་སྒྲོན་མ་དེ་གྲུབ་པོ།
en: They will achieve the lamp of discriminating wisdom.

source: །ཆོས་ཀྱི་རྣམ་འཕྲུལ་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays that are miracles of the Dharma,

source: །མི་ཟད་བཟོད་ཀྱི་གཟུངས་ནི་ཐོབ་གྱུར་ནས།
en: Will attain the dhāraṇī of inexhaustible patience

source: །དེ་བཞིན་གཤེགས་པ་ཀུན་གྱི་མཛོད་ཀྱང་འཛིན།
en: and maintain the treasure house of all tathāgatas.

source: །ཆོས་འཛིན་རྣམས་ལ་ཡོངས་སུ་ཕན་གདགས་ཏེ།
en: “ ‘Thoroughly securing benefits for those who maintain the Dharma,

source: །དྲང་སྲོང་རྣམས་ལ་ཆོས་ཀྱིས་བསྲུང་བྱས་ཤིང་།
en: They will protect the seers by means of Dharma

source: །འགྲོ་བ་ཆོས་ཀྱིས་རྗེས་སུ་བསྲུང་བྱས་པས།
en: And protect living beings by means of Dharma,

source: །ཆོས་ཀྱི་རྣམ་འཕྲུལ་འོད་ཟེར་གྲུབ་པར་འགྱུར།
en: And they will achieve light rays that are miracles of the Dharma.

source: །གཏོང་དང་ལྡན་པའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays imbued with generosity,

source: །སེམས་ཅན་འཇུངས་པ་གང་དག་དེས་བསྐུལ་བ།
en: And any greedy sentient beings inspired by that light,

source: །ལོངས་སྤྱོད་མི་རྟག་མི་བརྟན་ཤེས་གྱུར་ནས།
en: By learning that wealth is impermanent and instable,

source: །དེ་དག་རྟག་ཏུ་གཏོང་ལ་དགའ་མོས་འགྱུར།
en: Will come to always delight in giving things away.

source: །མ་དུལ་གདུལ་དཀའི་སེམས་ཅན་སེར་སྣ་ཅན།
en: “ ‘All greed-filled sentient beings that are obstinate and difficult to train,

source: །ནོར་རྣམས་རྨི་ལམ་སྤྲིན་དང་འདྲར་ཤེས་ནས།
en: By learning that objects of wealth are like clouds in a dream,

source: །དགའ་བའི་ཡིད་ཀྱིས་སྦྱིན་བ་སྤེལ་བྱས་པས།
en: Happily increase their acts of generosity,

source: །དེས་ན་སྟོང་དང་ལྡན་པའི་འོད་གྲུབ་པོ།
en: And therefore achieve light rays imbued with generosity.

source: །ཡོངས་སུ་གདུང་མེད་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays of freedom from pain,

source: །ཁྲིམས་འཆལ་སེམས་ཅན་གང་དག་དེས་བསྐུལ་བ།
en: And any sentient beings of impure moral discipline inspired by that light

source: །ཚུལ་ཁྲིམས་རྣམ་པར་དག་ལ་གནས་གྱུར་ནས།
en: Will come to observe pure moral discipline,

source: །རང་བྱུང་འགྱུར་བར་བྱ་ཞེས་སེམས་བསྐྱེད་དོ།
en: Conceiving the thought, “I will become a self-arisen one.”

source: །དགེ་བའི་ལས་ལམ་ཡོངས་སུ་དག་པ་དང་། །ཚུལ་ཁྲིམས་ལ་ཡང་སེམས་ཅན་མང་འཛུད་ཅིང་།
en: “ ‘By encouraging many sentient beings to observe moral discipline And to engage in pure paths of virtuous deeds,

source: །བྱང་ཆུབ་སེམས་ཀྱང་ཡང་དག་འཛིན་འཇུག་པས།
en: And by making them generate the thought of awakening,

source: །ཡོངས་གདུང་མེད་པའི་འོད་ཟེར་དེ་གྲུབ་པོ།
en: They will achieve light rays of freedom from pain.

source: །བཟོད་པ་བཀོད་པའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays imbued with arrays of patience,

source: །མི་བཟོད་སེམས་ཅན་གང་དག་དེས་བསྐུལ་བ།
en: And any impatient sentient beings inspired by that light

source: །ཁྲོ་དང་ཐ་བ་ང་རྒྱལ་ཡོངས་སྤངས་ཤིང་།
en: Will avoid anger, malice, and pride,

source: །དེ་དག་རྟག་ཏུ་བཟོད་མོས་དགའ་བར་འགྱུར།
en: And come to always appreciate patience.

source: །སྡིག་ལྡན་རྣམས་ཀྱི་ཉེས་བྱས་བཟོད་བྱས་ཏེ།
en: “ ‘Hence they patiently endure harm inflicted by sinful beings,

source: །བྱང་ཆུབ་དོན་དུ་འཁྲུགས་པ་མ་བྱས་ཤིང་།
en: And, for the sake of awakening, they do not engage in quarrels.

source: །བཟོད་པའི་ཡོན་ཏན་རྟག་ཏུ་བསྔགས་བརྗོད་པས།
en: By always expressing praise for the qualities of patience,

source: །དེས་ན་བཟོད་པ་བཀོད་པ་དེ་གྲུབ་པོ།
en: They achieve light rays imbued with arrays of patience.

source: །སྦྱངས་དང་ལྡན་པའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays imbued with purification,

source: །ལེ་ལོའི་སེམས་ཅན་གང་དག་དེས་བསྐུལ་བ།
en: And any lazy sentient beings inspired by that light

source: །རིགས་པར་བརྩོན་པ་དཀོན་མཆོག་གསུམ་རྣམས་ལ། །སྦྱོར་བ་སྐྱོ་མེད་མཆོད་པ་བྱེད་པར་འགྱུར།
en: Will practice suitable exertion And make offerings with untiring application to the Three Jewels.

source: །རིགས་པར་བརྩོན་པ་དཀོན་མཆོག་གསུམ་རྣམས་ལ། །སྦྱོར་བ་སྐྱོ་བ་མེད་པས་མཆོད་བྱས་ནས།
en: “ ‘Having practiced suitable ways of exertion For making offerings with untiring application to the Three Jewels,

source: །དེ་དག་བདུད་བཞིའི་ལམ་ལས་རབ་འདས་ཏེ།
en: They transcend the paths of the four māras

source: །བྱང་ཆུབ་བླ་མེད་མྱུར་དུ་རེག་པར་འགྱུར།
en: And quickly reach highest awakening.

source: །སེམས་ཅན་མང་པོ་བརྩོན་འགྲུས་འཛིན་བཅུག་སྟེ།
en: “ ‘Inspiring many sentient beings to exert diligence,

source: །དཀོན་མཆོག་གསུམ་ལ་མཆོད་པ་རབ་བྱས་ནས།
en: Having made offerings to the Three Jewels

source: །ཟད་པའི་དུས་ན་དམ་ཆོས་ཡོངས་བཟུང་བས།
en: By supporting the holy Dharma in times of exhaustion,

source: །དེས་ན་སྦྱངས་དང་ལྡན་བའི་འོད་ཐོབ་བོ།
en: They therefore achieve light rays imbued with purification.

source: །ཞི་བར་བྱེད་པའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays that pacify,

source: །རྣམ་འཁྲུགས་སེམས་ཅན་གང་དག་དེས་བསྐུལ་བ།
en: And the minds of any agitated sentient beings inspired by that light

source: །དེ་དག་ཆགས་མེད་སྡང་མེད་རྨོངས་མེད་ཅིང་། །རྟོགས་པར་གྱུར་ནས་མཉམ་གཞག་སེམས་སུ་འགྱུར།
en: Will understand and turn toward meditative attainments Once they are freed from desire, hatred, and confusion.

source: །སྡིག་པའི་གྲོགས་པོ་སྐྱོན་ལྡན་སྤྱོད་ཅན་དང་། །འདྲེ་བ་ཡོངས་སུ་རྣམ་པར་སྤང་བྱས་ཏེ།
en: “ ‘After strictly avoiding association With those who have faulty dealings with sinful friends,

source: །དགོན་པར་རབ་ཞི་བསམ་གཏན་བསྔགས་བརྗོད་པས།
en: By praising the virtues of tranquil meditative concentration in solitude,

source: །དེས་ན་ཞི་བར་བྱེད་པའི་འོད་གྲུབ་བོ།
en: They achieve light rays that pacify.

source: །ཤེས་རབ་བཀོད་པའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays imbued with arrays of discriminating wisdom,

source: །ཤེས་འཆལ་སེམས་ཅན་ཇི་སྙེད་དེས་བསྐུལ་བ།
en: And any sentient beings of defective understanding inspired by that light

source: །བདེན་དང་བརྟན་དང་རྣམ་ཐར་ཚུལ་རྣམས་དང་། །དབང་པོ་ཤེས་པ་རྟོགས་པར་ཁོང་ཆུད་འགྱུར།
en: Will learn, gaining an awareness Of truth, dependence, ways of emancipation, and the faculties.

source: །བདེན་དང་བརྟན་དང་རྣམ་ཐར་ཚུལ་རྣམས་དང་། །དབང་པོ་ཤེས་པ་རྟོགས་པར་ཁོང་ཆུད་ཅིང་།
en: “ ‘After learning, realizing an awareness of Truth, dependence, ways of emancipation, and the faculties,

source: །ཉི་མ་སྒྲོན་མའི་ཏིང་འཛིན་ཐོབ་གྱུར་ནས།
en: And attaining the absorption of the lamp of the sun,

source: །ཤེས་རབ་སྣང་བར་མཛད་པའི་རྒྱལ་བར་འགྱུར།
en: They will become victors who make discriminating wisdom shine brightly.

source: །རྒྱལ་སྲིད་ནོར་དང་བདག་ཕངས་ཡོངས་བཏང་སྟེ།
en: “ ‘Giving up the wealth of their kingdoms and selfish disappointments,

source: །བྱང་ཆུབ་དོན་དུ་ཆོས་གང་བཙལ་བྱས་པ།
en: Any Dharma they may seek for the sake of awakening,

source: །ཆོས་དེ་གུས་པར་བྱས་ནས་རབ་བཤད་པས།
en: When they devotedly explain that Dharma,

source: །ཤེས་རབ་བཀོད་པའི་འོད་ཟེར་དེ་གྲུབ་བོ།
en: Will make them attain light rays imbued with arrays of discriminating wisdom.

source: །སངས་རྒྱས་ལྡན་པའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays imbued with buddhas,

source: །སངས་རྒྱས་སྟོང་ཕྲག་དུ་མ་བསམ་ཡས་རྣམས།
en: Will behold those inconceivably many thousands of buddhas

source: །པད་མ་དམ་པ་རྣམས་ལ་བཞུགས་པར་མཐོང་།
en: Seated upon their noble lotus seats.

source: །སངས་རྒྱས་ཆེ་དང་སངས་རྒྱས་རྣམ་ཐར་དང་། །སངས་རྒྱས་རྣམ་འཕྲུལ་མཐའ་ཡས་བརྗོད་བྱས་ཤིང་།
en: “ ‘By describing the great qualities of the buddhas and of their emancipations, And the infinite magical powers of a buddha,

source: །སངས་རྒྱས་སྟོབས་དང་རྫུ་འཕྲུལ་རབ་བརྗོད་པས།
en: And by describing in detail the powers and magical displays of a buddha,

source: །དེ་ནས་སངས་རྒྱས་ལྡན་པའི་འོད་གྲུབ་བོ།
en: They will then achieve light rays imbued with buddhas.

source: །མི་འཇིགས་སྦྱིན་པའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays that grant protection from danger,

source: །འཇིགས་ཉེན་སེམས་ཅན་གང་དག་དེས་རེག་པ།
en: And any danger-afflicted sentient beings touched by that light

source: །འབྱུང་པོ་གཟའ་དང་གསད་བརྡེག་བཅིང་བ་དང་། །ནད་འགོ་འཇིགས་པ་ཀུན་ལས་ཐར་བར་འགྱུར།
en: Will become freed from all dangers such as that of evil spirits or planets causing paralysis, Or being bound and beaten to death, or being in the initial stages of serious illnesses.

source: །མི་འཇིགས་སྦྱིན་པས་སེམས་ཅན་གང་བསྐྱབས་དང་།
en: “ ‘Protecting sentient beings by granting protection from danger,

source: །སྲོག་ཆགས་གསོད་ལས་བཟློག་པ་བྱས་པ་དང་།
en: Preventing living beings and animals from being killed,

source: །འཇིགས་པ་སྐྱབས་ཚོལ་རྣམས་ལ་སྐྱབས་བྱས་པས།
en: And protecting those in danger and those seeking refuge,

source: །མི་འཇིགས་སྦྱིན་པའི་འོད་ཟེར་དེས་གྲུབ་བོ།
en: They achieve light rays that grant protection from danger.

source: །བདེ་བ་ཀུན་བྱེད་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays that create all kinds of happiness,

source: །ནད་པ་ན་བ་གང་དག་དེས་རེག་པ།
en: And any ill people touched by that light

source: །རྣམ་པ་ཀུན་དུ་ནད་ཀྱི་སྡུག་བསྔལ་ཐར།
en: Become freed in all respects from the suffering of their illnesses.

source: །བསམ་གཏན་ཏིང་འཛིན་བདེ་བ་རྣམས་ཀྱང་ཐོབ།
en: They also attain the happiness of meditative concentration and absorption.

source: །ནད་གསོས་འབྲས་བུ་སྨན་དང་རྩ་བ་དང་། །རིན་ཆེན་བཅུད་ལེན་སྤོས་དང་བྱུག་པ་དང་། །བུ་རམ་སྦྲང་རྩི་འོ་མ་མར་དག་དང་། །འབྲུ་མར་ཟས་སྐོམ་བྱིན་པས་དེ་ཐོབ་བོ།
en: “ ‘Giving them curative medicines, roots, Jewels, elixirs, fragrances, unguent oils, Brown sugar, honey, milk, butter, Mustard seed oil, or food and drink, they attain health.

source: །སངས་རྒྱས་སྟོན་པའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays that display the Buddha,

source: །ཚེ་ཟད་ཐ་མར་གང་དག་དེས་བསྐུལ་བ།
en: And any people inspired by those lights who have reached the last moments of life,

source: །སངས་རྒྱས་རྗེས་དྲན་སངས་རྒྱས་མཐོང་བར་འགྱུར།
en: Remembering the Buddha, will see the Buddha

source: །དེ་དག་ཤི་འཕོས་སངས་རྒྱས་བཞུགས་ཞིང་འགྲོ།
en: And after death will go to realms where buddhas dwell.

source: །འཆི་བའི་དུས་སུ་སངས་རྒྱས་དྲན་བྱས་ཏེ།
en: “ ‘Remembering the Buddha at the time of death,

source: །དགའ་བྱེད་རྒྱལ་བའི་སྐུ་གཟུགས་བསྟན་བྱས་ཤིང་།
en: The uplifting bodily form of the Victor is revealed,

source: །འཆི་ཀར་སངས་རྒྱས་སྐྱབས་སུ་གཏོང་བརྗོད་པས།
en: And expressing at the time of death that the Buddha is sent forth as refuge,

source: །སངས་རྒྱས་སྟོན་པའི་འོད་ཟེར་དེ་ཐོབ་བོ།
en: They achieve light rays that display the Buddha.

source: །ཆོས་རབ་རྗོད་པའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays that expound the Dharma,

source: །ཆོས་ཉན་ཀློག་ཅིང་ཡི་གེར་འདྲི་བར་བྱེད།
en: Will cause the Dharma to be read, recited, and written in texts

source: །དེ་དག་རྟག་ཏུ་ཆོས་ལ་དགའ་མོས་འགྱུར།
en: And will always feel a devotional appreciation of the Dharma.

source: །ཆོས་ཀྱི་མུ་གེ་བྱུང་ཚེ་ཆོས་བརྗོད་དེ།
en: “ ‘When famines of Dharma occur, they will expound the Dharma

source: །ཆོས་ཚོལ་རྣམས་ཀྱི་བསམ་བ་རྫོགས་བྱས་ཤིང་།
en: And satisfy the hopes of those searching for Dharma.

source: །འདུན་པ་བསྐྱེད་དེ་ཆོས་ལ་བརྩོན་གྱིས་ཞེས། །བརྗོད་པས་ཆོས་རབ་བརྗོད་པ་དེ་ཐོབ་བོ།
en: By saying “Exert yourselves in Dharma!” they will encourage motivation toward the Dharma. They achieve the expounding of Dharma.

source: །སངས་རྒྱས་སྲས་རྣམས་ཡོངས་སུ་བསྐུལ་བའི་ཕྱིར།
en: “ ‘In order to encourage the sons of the Buddha,

source: །དབྱངས་དང་ལྡན་པའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: They emanate light rays imbued with sweet sounds,

source: །འཇིག་རྟེན་གསུམ་ན་སྒྲ་རྒྱུད་ཇི་སྙེད་པ།
en: And whatever sound streams occur in the threefold universe,

source: །ཀུན་ཀྱང་དེ་བཞིན་གཤེགས་པའི་གསུང་དུ་ཐོས།
en: All are heard as the Buddha’s voice.

source: །གསང་བསྟོད་སྒྲ་ཡིས་དྲང་སྲོང་ཆེ་བསྟོད་དེ།
en: “ ‘By praising the Great Seer through secret eulogies

source: །རྒྱལ་བའི་གསུང་སྒྲ་དོན་དུ་སིལ་སྙན་དང་། །སྒྲ་ཆེན་དྲིལ་བུ་སྦྱིན་རྣམས་འགྲོ་ཀུན་ལ།
en: For the sake of the sound of the Victor’s voice, And by loudly ringing for all living beings The cymbals and large bells that are given as gifts,

source: །རབ་ཏུ་བསྒྲགས་པས་དབྱངས་ལྡན་འོད་གྲུབ་བོ།
en: They achieve light rays that have sweet sounds.

source: །འཆི་མེད་སྦྱིན་པའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays that grant immortality,

source: །བག་མེད་སྤྱོད་པ་ཐམས་ཅད་རབ་སྤངས་ཏེ།
en: Will avoid all careless behavior

source: །ཡོན་ཏན་ཀུན་ལ་བརྩོན་པ་ཉམས་སུ་ལེན།
en: And will devote themselves to cultivating every good quality.

source: །འདུས་བྱས་རྟག་ཏུ་བདེ་བ་མེད་པ་སྟེ། །སྡུག་བསྔལ་འཚེ་བ་དུ་མས་ཡོངས་སུ་གང་། །འགོག་པ་རྟག་ཏུ་བདེ་ཞིང་ཞི་སྐྱིད་ཅེས། །བརྗོད་པས་འཆི་མེད་སྦྱིན་བ་དེ་ཐོབ་བོ།
en: “ ‘By teaching, “Conditioned things are always unpleasant And are filled with many afflicting sufferings, While cessation is always pleasant and peaceful,” They attain light rays that grant immortality.

source: །ཁྱད་པར་ལྡན་བའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays imbued with special features,

source: །རྒྱལ་བ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་ཁྱད་པར་དང་། །ཏིང་འཛིན་ཁྱད་པར་ཤེས་རབ་ཁྱད་པར་ཐོས།
en: Hear the special features of the victors’ moral conduct, The special features of their absorption, and special features of discriminating wisdom.

source: །ཐུབ་ཆེན་རྒྱལ་པོའི་ཁྲིམས་ཀྱིས་མཆོག་གྱུར་ཅིང་། །ཏིང་འཛིན་མཆོག་དང་ཤེས་རབ་མཆོག་གྱུར་ཅེས། །བྱང་ཆུབ་དོན་དུ་བསྟོད་ཅིང་བསྔགས་བརྗོད་པས། །དེས་ན་ཁྱད་པར་ལྡན་པའི་འོད་གྲུབ་བོ།
en: “ ‘By giving praise for the sake of awakening and by greatly extoling with the words, “The Great Muni’s royal law is best, His absorption is best, and his discriminating wisdom is best!” They thus achieve light rays imbued with special features.

source: །རིན་ཆེན་བཀོད་པའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays imbued with arrays of jewels,

source: །རིན་ཆེན་མི་ཟད་གཏེར་རྣམས་ཐོབ་གྱུར་ནས།
en: After attaining inexhaustible treasures of jewels,

source: །དྲང་སྲོང་ཆེ་ལ་རིན་ཆེན་དམ་པས་མཆོད།
en: Will worship the Great Seer through the best of jewels.

source: །རྒྱལ་དང་རྒྱལ་བའི་མཆོད་རྟེན་རིན་ཆེན་ཕུལ།
en: “ ‘They offer jewels of the Victor and stūpas.

source: །སྐྱེ་བོ་ཉོན་མོངས་རིན་ཆེན་རྣམས་ཀྱིས་བསྡུས།
en: By attracting defilement-filled living beings with jewels

source: །རྒྱལ་བ་རྣམས་ལ་རིན་ཆེན་རབ་ཕུལ་བས།
en: And offering jewels to the victors,

source: །རིན་ཆེན་བཀོད་པའི་འོད་ཟེར་གྲུབ་པར་འགྱུར།
en: They achieve light rays imbued with arrays of jewels.

source: །སྤོས་རབ་སྣང་བའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays imbued with distinctive fragrance,

source: །མི་ལ་མེད་སྤོས་ཡིད་འོང་ཚོར་གྱུར་ནས།
en: Having smelled the pleasant otherworldly fragrance,

source: །སངས་རྒྱས་ཡོན་ཏན་རྣམས་ལ་ངེས་པར་འགྱུར།
en: Will ascertain the qualities of the Buddha.

source: །མི་དང་ལྷ་ཡི་སྤོས་དང་བྱུག་པ་ཡིས། །མི་ཡི་གཙོ་ལ་མཆོད་པར་རབ་བྱས་ཏེ།
en: “ ‘Having worshiped well the Chief among Humans through offerings, Using human and divine fragrance and unguent oils,

source: །སྤོས་ལས་རྒྱལ་བའི་གཟུགས་དང་མཆོད་རྟེན་དག །བྱས་པས་སྤོས་རབ་སྣང་བ་དེ་གྲུབ་བོ།
en: And fashioning victors’ bodies and stūpas from fragrances, They achieve light rays imbued with distinctive fragrance.

source: །སྣ་ཚོགས་བཀོད་པའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays imbued with myriad arrays,

source: །རྒྱལ་མཚན་བ་དན་གདུགས་མཆོག་སྣ་ཚོགས་དང་། །སིལ་སྙན་བསྒྲགས་ཤིང་སྤོས་ཀྱིས་བདུག་པ་ཡིས།
en: And with various banners, flags, and superior parasols, And with cymbals ringing out and filling the air with incense smoke,

source: །ཕོ་བྲང་དམ་པ་མཛེས་བྱས་མེ་ཏོག་བཀྲམ།
en: The noble palace is decorated by flowers that are strewn about.

source: །སིལ་སྙན་དག་གིས་རྒྱལ་བ་རྣམས་བསུ་ཞིང་།
en: “ ‘Welcoming the victors with the ringing of cymbals,

source: །མེ་ཏོག་བྱུག་པ་བདུག་སྤོས་ཕྱེ་མ་དང་། །རྒྱལ་མཚན་བ་དན་གདུགས་མཆོག་རྣམས་ཀྱིས་མཆོད།
en: They worship the Buddha with flowers, unguent oils, incense, Scented powders, banners, flags, and superior parasols.

source: །དེས་ན་སྣ་ཚོགས་བཀོད་པ་གྲུབ་པར་གྱུར།
en: Thus will they achieve light rays imbued with myriad arrays.

source: །ཤིན་ཏུ་དང་བྱེད་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays that greatly illuminate,

source: །ས་རྣམས་ལག་མཐིལ་བཞིན་དུ་གནས་པར་བྱེད།
en: And the lands become as flat and smooth as the palm of one’s hand.

source: །མཆོད་རྟེན་དྲང་སྲོང་གནས་རྣམས་སྦྱངས་བྱས་པས།
en: Having purified the locales of stūpas and seers,

source: །དེས་ན་ཤིན་ཏུ་དང་བའི་འོད་གྲུབ་བོ།
en: They thus achieve light rays that greatly illuminate.

source: །སྤྲིན་དང་ལྡན་པའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays wreathed in clouds,

source: །སྤོས་ཀྱི་ཆར་འབེབས་སྤྲིན་རྣམས་ཀུན་དུ་གནས།
en: And the clouds that gather shower down fragrant rain,

source: །མཆོད་རྟེན་འཁོར་སར་སྤོས་ཀྱི་ཆུས་བཏབ་པས།
en: And by sprinkling the circumambulation path around a stūpa with scented water,

source: །སྤྲིན་དང་ལྡན་པའི་འོད་དེ་རབ་ཏུ་ཐོབ།
en: They achieve light rays wreathed in clouds.

source: །ལྷབ་ལྷུབ་བཀོད་པའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays in the form of flickering arrays,

source: །གཅེར་བུ་གོས་ཡོད་རྒྱན་དང་ལྡན་པར་འགྱུར།
en: And they make those lacking clothing possess garments and ornaments.

source: །གོས་དང་བགོ་བ་རྒྱན་ཕྲེང་སྣ་ཚོགས་དག །སྦྱིན་པ་བྱས་པས་ལྷབ་ལྷུབ་བཀོད་པ་གྲུབ།
en: By giving clothing, raiment, and various necklaces, They achieve light rays in the form of flickering arrays.

source: །རོ་མཆོག་ལྡན་པའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays endowed with food with the best of tastes,

source: །བཀྲེས་པ་ཁ་ཟས་རོ་མཆོག་ཐོབ་པར་འགྱུར།
en: And they cause those who are hungry to attain food with the best of tastes.

source: །ཟས་དང་སྐོམ་དང་རོ་མཆོག་སྣ་ཚོགས་རྣམས། །བྱིན་པས་རོ་མཆོག་ལྡན་བའི་འོད་གྲུབ་བོ།
en: By giving them food and drink and various foods with the best of tastes, They achieve light rays endowed with food with the best of tastes.

source: །ནོར་རྣམས་སྟོན་པའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays that reveal wealth,

source: །དབུལ་པོ་དག་གིས་རིན་ཆེན་གཏེར་རྣམས་འཐོབ།
en: And poor people attain treasures of jewels.

source: །དཀོན་མཆོག་གསུམ་ལ་གཏེར་གཞི་མི་ཟད་པ། །དབུལ་བ་བྱས་པས་ནོར་སྟོན་འོད་ཐོབ་བོ།
en: By offering inexhaustible treasure deposits to the Three Jewels, They attain light rays that reveal wealth.

source: །མིག་རྣམ་སྦྱོང་བའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays that purify the eyes,

source: །དེ་ཚེ་ལོང་བས་སྣ་ཚོགས་གཟུགས་རྣམས་མཐོང་།
en: And at that time the blind see various shapes.

source: །རྒྱལ་བ་དག་དང་རྒྱལ་བའི་མཆོད་རྟེན་ལ། །མར་མེ་ཕུལ་བས་མིག་སྦྱོང་འོད་ཟེར་གྲུབ།
en: By offering lamps to the victors and their stūpas, They achieve light rays that purify the eyes.

source: །རྣ་བ་རྣམ་སྦྱོང་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays that purify the ears,

source: །རྣ་བ་ཉམས་པས་སྒྲ་མང་ཐོས་པར་འགྱུར།
en: And as a result, those with defective ears will hear many sounds.

source: །རྒྱལ་བ་རྣམས་དང་རྒྱལ་བའི་མཆོད་རྟེན་ལ། །སིལ་སྙན་ཕུལ་བས་རྣ་སྦྱོང་འོད་ཟེར་གྲུབ།
en: By offering cymbals to the victors and their stūpas, They achieve light rays that purify the ears.

source: །སྣ་རྣམ་སྦྱོང་བའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays that purify the nose,

source: །སྔོན་ཆད་མ་ཚོར་དྲི་ཞིམ་ཚོར་བར་འགྱུར།
en: And the audience will smell fragrances never before smelled.

source: །རྒྱལ་བ་རྣམས་དང་རྒྱལ་བའི་མཆོད་རྟེན་ལ།
en: By offering fragrances to the victors and their stūpas,

source: །སྤོས་རབ་ཕུལ་བས་སྣ་སྦྱོང་འོད་ཟེར་གྲུབ།
en: They will achieve light rays that purify the nose.

source: །ལྕེ་རྣམ་སྦྱོང་བའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays that purify the tongue,

source: །སྒྲ་སྙན་ཡིད་འོང་རྣམས་ཀྱིས་སངས་རྒྱས་བསྟོད།
en: And with sweet, pleasant sounds praise the Buddha.

source: །མི་སྙན་བརླང་བར་སྨྲ་བ་རྣམ་སྤངས་ཏེ།
en: Avoiding unpleasant, coarse sounds

source: །འཇམ་པར་སྨྲས་པས་ལྕེ་སྦྱོང་འོད་ཟེར་གྲུབ།
en: And using soft speech, they achieve light rays that purify the tongue.

source: །ལུས་རྣམ་སྦྱོང་བའི་འོད་ཟེར་རབ་གཏོང་ཞིང་། །དབང་པོ་ཉམས་པ་དབང་པོ་ལྡན་པར་འགྱུར།
en: “ ‘They emanate light rays that purify the aspects of form, And those with defective sense faculties will gain working ones.

source: །རྒྱལ་བ་རྣམས་དང་རྒྱལ་བའི་མཆོད་རྟེན་ལ། །ལུས་བཏུད་བྱས་པས་ལུས་རྣམ་སྦྱོང་བ་ཐོབ།
en: Through bowing their bodies to the bodily forms of the victors And the victors’ stūpas, they achieve a purified body.

source: །སེམས་རྣམ་སྦྱོང་བའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays that purify the mind,

source: །སྨྱོས་པ་ཐམས་ཅད་སེམས་དང་ལྡན་པར་འགྱུར།
en: And all mad people will become sane.

source: །ཏིང་འཛིན་དབང་རྗེས་སེམས་འགྲོ་བྱས་པས་ན།
en: By causing the mind to go after the faculty of absorption,

source: །སེམས་རྣམ་སྦྱོང་བའི་འོད་ཟེར་དེ་གྲུབ་བོ།
en: They achieve light rays that purify the mind.

source: །གཟུགས་རྣམ་སྦྱོང་བའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays that purify the body,

source: །མི་དབང་རྣམས་ཀྱི་བསམ་ཡས་སྐུ་མཐོང་སྟེ།
en: And human rulers see inconceivably many buddha bodies.

source: །སྐུ་གཟུགས་རི་མོ་སྣ་ཚོགས་མང་པོ་དང་། །མཆོད་རྟེན་བརྒྱན་བྱས་གཟུགས་སྦྱོང་འོད་གྲུབ་བོ།
en: By painting many pictures of buddhas of various kinds And by ornamenting stūpas, they achieve light rays that purify the body.

source: །སྒྲ་རྣམ་སྦྱོང་བའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays that purify sounds,

source: །སྒྲ་ནི་སྒྲ་མི་སྟོང་པར་རབ་ཏུ་ཤེས།
en: And they understand sounds to be non-sounds, empty.

source: །རྐྱེན་ལས་བྱུང་བས་བྲག་ཅ་འདྲའོ་ཞེས།
en: By teaching sounds to be “like an echo, since they arise through conditions,”

source: །སྒྲ་རྣམས་བསྟན་པས་འོད་ཟེར་དེ་གྲུབ་བོ།
en: They achieve light rays that purify sounds.

source: །དྲི་རྣམ་སྦྱོང་བའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays that purify scents,

source: །དྲིང་ཐམས་ཅད་དྲི་ཞིམ་མཆོག་ཏུ་འགྱུར།
en: And all scents become the best scents of all.

source: །སྤོས་རབ་མཆོག་ཆུས་རྒྱལ་བའི་མཆོད་རྟེན་དག །ཁྲུས་བྱས་བྱང་ཆུབ་ཞིང་གི་འོད་དེ་ཡིན།
en: Washing the stūpas of the victors with water scented with the best fragrance, Such are the lights of the field of awakening.

source: །རོ་བྲོ་སྦྱོང་བའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays that purify tastes,

source: །དུག་ཅན་དུག་མེད་རོ་ཡི་མཆོག་ཏུ་འགྱུར།
en: And foods and drinks, whether poisonous or wholesome, will have the finest of tastes.

source: །སངས་རྒྱས་ཉན་ཐོས་བཅས་དང་ཕ་མ་ལ། །རོ་མཆོག་ཐམས་ཅད་ཕུལ་བའི་འོད་དེ་ཡིན།
en: All those finest tastes are the light rays that are offered To the buddhas and śrāvakas or to their parents.

source: །རེག་རྣམ་སྦྱོང་བའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays that purify touch,

source: །རེག་ན་རྩུབ་པ་འཇམ་ཞིང་བདེ་བར་འགྱུར།
en: And all rough sensations become smooth and pleasant.

source: །མདུང་ཐུང་རྩེ་གསུམ་རལ་གྲི་མདའ་ཆེན་ཆར།
en: A great shower of sharp weapons such as short spears, tridents, swords, and long arrows

source: །ཕྲེང་བ་འཇམ་པ་པད་མ་ཨུད་པལ་འགྱུར།
en: Will become as smooth as a garland of flowers and like lotuses.

source: །བཅོས་བུའི་རས་མང་འཇམ་ཞིང་རེག་བདེ་རྣམས། །རྒྱལ་བ་རྣམས་ཀྱི་གཤེགས་ཤུལ་བཏིང་བཀྲམ་སྟེ།
en: “ ‘That is the light from offering Soft and smooth, very fine quality cotton cloth, Spreading it out on the ground for the victors to tread upon,

source: །མེ་ཏོག་བྱུག་པ་ན་བཟའ་འཇམ་རྣམས་དང་། །ཕྲེང་བ་བླ་རེ་ཕུལ་བའི་འོད་དེ་ཡིན།
en: With flowers, unguent oils, soft robes, necklaces, and canopies.
